# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# shell
brew "bash"
brew "zsh"
brew "fish"

# Git
brew "git"

# Docker
brew "docker"

# others
brew "bat"
brew "exa"
brew "colordiff"
brew "qrencode"
brew "rename"
brew "tree"
brew "wget"
brew "asdf"

if OS.mac?
    # iOS
    brew "cocoapods"
    brew "carthage"
    brew "fastlane"
    brew "swiftlint"

    # Mac Apps
    cask "android-studio"
    cask "anydesk"
    cask "discord"
    # cask "docker"
    cask "gas-mask"
    cask "google-chrome"
    cask "google-japanese-ime"
    cask "iterm2"
    cask "postman"
    cask "shiftit"
    cask "visual-studio-code"
    cask "zoom"

    # others
end
