# shell
brew "bash"
brew "zsh"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "stern"
brew "skaffold"
brew "minikube"

# Node.js
brew "node"
brew "yarn"

# Ruby
brew "ruby"
brew "rbenv"

# Python
brew "python@3.10"

# PHP
brew "php"
brew "composer"

# Kotlin
brew "kotlin"
brew "ktlint"
brew "openjdk@11"
brew "gradle"

# Git
brew "git"
brew "pre-commit"
brew "lazygit"

# snyk
tap "snyk/tap"
brew "snyk"

# others
brew "bat"
brew "exa"
brew "colordiff"
brew "jq"
brew "qrencode"
brew "rename"
brew "tree"
brew "wget"
brew "nvim"
brew "asdf"

if OS.mac?
    # iOS
    brew "cocoapods"
    brew "carthage"
    brew "fastlane"
    brew "swiftlint"

    # Mac Apps
    cask "android-studio"
    cask "anydesk"
    cask "discord"
    # cask "docker"
    cask "gas-mask"
    cask "google-chrome"
    cask "google-japanese-ime"
    cask "iterm2"
    cask "postman"
    cask "shiftit"
    cask "visual-studio-code"
    cask "zoom"

    # others
end
